; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	infrared0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star6 - direction
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument6 image2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite3 GroundStation7)
	(have_image Star8 image2)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 image2)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 image2)
))

)

; plan
1. (turn_to satellite3 groundstation7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation7)
   goals met: 1 of 8
2. (turn_to satellite0 groundstation2 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 8
9. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 4 of 8
11. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 8
12. (take_image satellite0 planet11 instrument0 image2)
   added: (have_image planet11 image2)
   goals met: 5 of 8
13. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 5 of 8
14. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 8
15. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
16. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 8 of 8
